# Brewfile

## To install:
# brew bundle install
# Later, to clean anything installed but not in Brewfile:
# brew bundle cleanup --force

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# --- Formulae ---
brew "bat"          # cat replacement with syntax highlighting
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "direnv"
brew "dust"         # du replacement
brew "eza"          # modern ls (exa successor)
brew "fd"           # find replacement
brew "fzf"
brew "git"
brew "gh"
brew "git-delta"    # beautiful git diffs
brew "gnupg"
brew "lazygit"      # git TUI
brew "node"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "ripgrep"
brew "rsync"
brew "starship"     # modern shell prompt
brew "texlive"
brew "tmux"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "zoxide"

# --- Casks ---
cask "1password-cli"
cask "aerospace"
cask "blackhole-2ch"
cask "hammerspoon"
cask "ngrok"
